In [1]:
from pyspark.sql import *
from pyspark import SparkContext
sc = SparkContext()
sqlContext=SQLContext(sc)

In [2]:
employee_df=sqlContext.read.json("hdfs://nameservice1/user/edureka_294428/Employees.json") #in webconsole, you can also use sqlContext instead of spark

In [3]:
employee_df.show()

+---+---------+------+
| ID|     Name|Salary|
+---+---------+------+
|  1|     John| 20000|
|  2|    Rohit| 15000|
|  3|    Parth| 14600|
|  4|  Rishabh| 20500|
|  5|    Daisy| 34000|
|  6|    Annie| 23000|
|  7| Sushmita| 50000|
|  8| Kaivalya| 20000|
|  9|    Varun| 70000|
| 10|Shambhavi| 21500|
| 11|  Johnson| 25500|
| 12|     Riya| 17000|
| 13|    Krish| 17000|
| 14| Akanksha| 20000|
| 15|   Rutuja| 21000|
+---+---------+------+

In [4]:
demo=sqlContext.read.json("hdfs://nameservice1/user/edureka_294428/demo.json")
demo.show()

+--------------------+
|     _corrupt_record|
+--------------------+
|                   {|
|    "fruit": "App...|
|    "size": "Large",|
|      "color": "Red"|
|                   }|
+--------------------+

In [5]:
employee_df.printSchema()

root
 |-- ID: long (nullable = true)
 |-- Name: string (nullable = true)
 |-- Salary: long (nullable = true)

In [6]:
employee_df.select("Salary").show()

+------+
|Salary|
+------+
| 20000|
| 15000|
| 14600|
| 20500|
| 34000|
| 23000|
| 50000|
| 20000|
| 70000|
| 21500|
| 25500|
| 17000|
| 17000|
| 20000|
| 21000|
+------+

In [7]:
employee_df.select(employee_df['Name'], employee_df['Salary'] + 10).show()

+---------+-------------+
|     Name|(Salary + 10)|
+---------+-------------+
|     John|        20010|
|    Rohit|        15010|
|    Parth|        14610|
|  Rishabh|        20510|
|    Daisy|        34010|
|    Annie|        23010|
| Sushmita|        50010|
| Kaivalya|        20010|
|    Varun|        70010|
|Shambhavi|        21510|
|  Johnson|        25510|
|     Riya|        17010|
|    Krish|        17010|
| Akanksha|        20010|
|   Rutuja|        21010|
+---------+-------------+

In [8]:
employee_df.filter(employee_df['ID'] > 9).show()

+---+---------+------+
| ID|     Name|Salary|
+---+---------+------+
| 10|Shambhavi| 21500|
| 11|  Johnson| 25500|
| 12|     Riya| 17000|
| 13|    Krish| 17000|
| 14| Akanksha| 20000|
| 15|   Rutuja| 21000|
+---+---------+------+

In [9]:
employee_df.groupBy("Salary").count().show()

+------+-----+
|Salary|count|
+------+-----+
| 21000|    1|
| 21500|    1|
| 14600|    1|
| 23000|    1|
| 25500|    1|
| 34000|    1|
| 20000|    3|
| 70000|    1|
| 17000|    2|
| 15000|    1|
| 20500|    1|
| 50000|    1|
+------+-----+

In [10]:
employee_df.createOrReplaceTempView("EMP")
sqlDF = sqlContext.sql("SELECT * FROM EMP")
sqlDF.show()

+---+---------+------+
| ID|     Name|Salary|
+---+---------+------+
|  1|     John| 20000|
|  2|    Rohit| 15000|
|  3|    Parth| 14600|
|  4|  Rishabh| 20500|
|  5|    Daisy| 34000|
|  6|    Annie| 23000|
|  7| Sushmita| 50000|
|  8| Kaivalya| 20000|
|  9|    Varun| 70000|
| 10|Shambhavi| 21500|
| 11|  Johnson| 25500|
| 12|     Riya| 17000|
| 13|    Krish| 17000|
| 14| Akanksha| 20000|
| 15|   Rutuja| 21000|
+---+---------+------+

In [11]:
#parquet file

In [12]:
peopleDF=sqlContext.read.json("hdfs://nameservice1/user/edureka_294428/people.json")

In [14]:
peopleDF.write.parquet("hdfs://nameservice1/user/edureka_294428/people3.parquet")

In [15]:
parquetFile=sqlContext.read.parquet("people3.parquet")

In [20]:
parquetFile.createOrReplaceTempView('parquetFile')

In [21]:
teenagers=sqlContext.sql("SELECT name FROM parquetFile WHERE age>=13 AND age<=19")

In [22]:
teenagers.show()

+------+
|  name|
+------+
|justin|
+------+

In [23]:
#UDF

In [25]:
peopleDF = sqlContext.read.json("hdfs://nameservice1/user/edureka_294428/people.json")

In [26]:
sqlContext.registerFunction("uppercase", lambda x:x.upper())

In [27]:
peopleDF.createOrReplaceTempView("PEP")

In [28]:
newRDD=sqlContext.sql("SELECT uppercase(name) FROM PEP WHERE age>20")

In [29]:
newRDD.show()

+---------------+
|uppercase(name)|
+---------------+
|        MICHAEL|
|           ANDY|
+---------------+